# 4.9 Part 1

### This script contains the following points:

#### 1. (Step 3a) Importing libraries, defining project path, and importing dataset.
#### 2. (Step 3b) Reviewing df_customers (size, shape, info, descriptive stats)
#### 3. (Step 4) Wrangling customer dataset
#### 4. (Step 4a) Reviewing and renaming column names.
#### 5. (Step 4b) Dropping column names with customer information.
#### 6. (Step 5) Consistency checks customer dataset
#### 7. (Step 5a) Checking for mixed data types (none found).
#### 8. (Step 5b) Checking for missing values (none found).
#### 9. (Step 5c) Checking for duplicate values (none found).
#### 10. (Step 5d) Reviewing frequency tables of columns 'state' and 'fam_status'.
#### 11. (Step 5e) Exporting dataset

In [2]:
#Importing Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
path = r'/Users/ronaldcameron/Documents/Data Analytics/Achievement 4 - Python/02:2023 Insta Cart Basket Analysis/Data/Original Data'

In [6]:
customer_data = pd.read_csv(r'/Users/ronaldcameron/Documents/Data Analytics/Achievement 4 - Python/02:2023 Insta Cart Basket Analysis/Data/Original Data/customers.csv', index_col = False)

In [7]:
customer_data.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
customer_data.shape

(206209, 10)

# Data Wrangling

In [9]:
#Checking for missing values
customer_data.isnull().sum()

user_id             0
First Name      11259
Surnam              0
Gender              0
STATE               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [10]:
#Deleting unecessary columns 
customer_data = customer_data.drop(columns = ['First Name','Surnam'])

In [11]:
#Renaming columns 
customer_data.rename(columns = {'STATE' : 'state','Age' : 'age', 'Gender' : 'gender', 
                               'fam_status' : 'family_status','n_dependants' : 'number_dependants'}, inplace = True)

In [12]:
customer_data.head()

,user_id,gender,state,age,date_joined,number_dependants,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
#Data Type Check
customer_data['user_id'].dtype

dtype('int64')

In [14]:
customer_data.describe()

             user_id            age  number_dependants         income
count  206209.000000  206209.000000      206209.000000  206209.000000
mean   103105.000000      49.501646           1.499823   94632.852548
std     59527.555167      18.480962           1.118433   42473.786988
min         1.000000      18.000000           0.000000   25903.000000
25%     51553.000000      33.000000           0.000000   59874.000000
50%    103105.000000      49.000000           1.000000   93547.000000
75%    154657.000000      66.000000           3.000000  124244.000000
max    206209.000000      81.000000           3.000000  593901.000000

In [15]:
#Checking for mixed-type data
for col in customer_data.columns.tolist():
  weird = (customer_data[[col]].applymap(type) != customer_data[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer_data[weird]) > 0:
    print (col)

In [16]:
#Checking for duplicates
customer_data[customer_data.duplicated()]

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_dependants, family_status, income]
Index: []

In [17]:
#Merging Data Sets 
orders_products_merged= pd.read_pickle(r'/Users/ronaldcameron/Documents/Data Analytics/Achievement 4 - Python/02:2023 Insta Cart Basket Analysis/Data/Prepared Data/ords_prods_merge_update2.pkl')

In [18]:
ords_prods_custm = pd.merge(orders_products_merged, customer_data, on = 'user_id', how = 'outer')

In [19]:
ords_prods_custm.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,...,spending_flag,prior_orders,frequency_flag,gender,state,age,date_joined,number_dependants,family_status,income
0,0.0,1.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,3139998.0,138,28.0,6.0,...,Low spender,10.4,Regular customer,Male,Minnesota,81,8/1/2019,1,married,49620
1,0.0,1.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,1977647.0,138,30.0,6.0,...,Low spender,10.4,Regular customer,Male,Minnesota,81,8/1/2019,1,married,49620
2,907.0,907.0,Premium Sliced Bacon,106.0,12.0,20.0,2254091.0,138,10.0,5.0,...,Low spender,10.4,Regular customer,Male,Minnesota,81,8/1/2019,1,married,49620
3,1000.0,1000.0,Apricots,18.0,10.0,12.9,505689.0,138,9.0,6.0,...,Low spender,10.4,Regular customer,Male,Minnesota,81,8/1/2019,1,married,49620
4,3265.0,3265.0,Mini Seedless Watermelon Pack,32.0,4.0,1.7,960220.0,138,17.0,5.0,...,Low spender,10.4,Regular customer,Male,Minnesota,81,8/1/2019,1,married,49620

In [20]:
ords_prods_custm.shape

(30328764, 33)

In [21]:
ords_prods_custm['_merge'].value_counts()

both          30328763
left_only            0
right_only           0
Name: _merge, dtype: int64

In [20]:
#Exporting data
ords_prods_custm.to_pickle(os.path.join(path, 'orders_products_customers.pkl'))

In [22]:
ords_prods_custm.shape

(30328764, 33)